using System;

namespace basic_lesson1_solution3
{
    /*
     * Задание 3
    Используя Visual Studio, создайте проект по шаблону Console Application.
    Требуется:
    Создать класс Book. Создать классы Title, Author и Content, каждый из которых должен содержать
    одно строковое поле и метод void Show().
    Реализуйте возможность добавления в книгу названия книги, имени автора и содержания.
    Выведите на экран разными цветами при помощи метода Show() название книги, имя автора и
    содержание. 
    */
    class Program
    {
        static void Main(string[] args)
        {
            Book book = new Book(" Мир Софии ");
            book.author = "Юстйен Гордер";
            book.content = @"...в конечном счете нечто должно было когда-то возникнуть из совершенной пустоты...
София Амуннсен возвра...";
            book.Show();
        }
    }
}
