using System;

    /*
     * Задание 2
    Создайте свою пользовательскую сборку по примеру сборки CarLibrary из урока, сборка будет
    использоваться для работы с конвертером температуры. 
    */

namespace prof_lesson6_2
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
